#include <iostream>
#include <Windows.h>
#include <cmath>

int main() {
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
	const int l = 100;
	int m[l] = { 16, 78, 99, 6, -29, 19, -52, 65, -88, 51,
				 -79, -22, 32, -25, -62, -69, -2, -59, -75, 89,
				 -87, 95, -22, 85, -49, -75, 76, 73, -59, -52,
				 30, 49, -28, -48, 0, 57, -6, -85, 0, -18,
				 -97, -21, -95, 64, 22, -2, 69, -84, -1, -71,
				 -25, 47, 72, 43, 15, -44, 44, 61, 4, 74,
				 88, -61, 0, -64, -83, 97, 0, 90, 15, 8,
				 -54, 19, 73, 35, -67, -87, 85, -99, -70, 10,
				 98, 58, -10, -29, 95, 62, 77, 89, 36, -32,
				 78, 60, -79, -18, 30, -13, -34, -92, 1, -38 };
	int sum = 0;
	for (int i = 0; i < l; i++) {
		if (m[i] < 0) {
			sum += *(m+i);
		}
	}
	std::cout << "Сумма отрицательных элементов равна " << sum;
	std::cout << "\nАдреса всех строк:\n";
	const int nl = 20, nw = 5;
    int nm[nl][nw];
	for (int i = 0; i < nl; i ++) {
		for (int j = 0; j < nw; j++) {
			*(*(nm + i) + j) = *(m + (i * nw + j));
		}
		std::cout << "Строка " << i + 1 << " " << nm+i <<"\n";
	}

	system("pause");
	return 0;
}